{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "decoder": {
    "activation_function": "gelu_new",
    "add_cross_attention": true,
    "attn_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "initializer_range": 0.02,
    "is_decoder": true,
    "layer_norm_epsilon": 1e-05,
    "model_type": "gpt2",
    "n_embd": 256,
    "n_head": 4,
    "n_inner": null,
    "n_layer": 2,
    "n_positions": 512,
    "reorder_and_upcast_attn": false,
    "resid_pdrop": 0.1,
    "scale_attn_by_inverse_layer_idx": false,
    "scale_attn_weights": true,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "use_cache": true,
    "vocab_size": 261
  },
  "decoder_start_token_id": 0,
  "dtype": "float32",
  "encoder": {
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 1024,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "roberta",
    "num_attention_heads": 4,
    "num_hidden_layers": 2,
    "position_embedding_type": "absolute",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 261
  },
  "eos_token_id": 2,
  "is_encoder_decoder": true,
  "max_length": null,
  "model_type": "encoder-decoder",
  "num_beams": null,
  "pad_token_id": 1,
  "transformers_version": "4.57.1",
  "vocab_size": 261
}
